yoann-darche/micropython/ports/esp32/machine_pwm.c
        // Choose appropriate clock from best available clock
        #if !(PWM_SUPPORT_INDEP_CLOCK_SRC)
        ledc_clk_cfg_t pwm_clk = find_clock_in_use();
        if (pwm_clk != LEDC_AUTO_CLK) {
            pwm_src_clock = pwm_clk;
        } else {

            #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
            pwm_src_clock = LEDC_USE_PLL_DIV_CLK;
            #elif SOC_LEDC_SUPPORT_APB_CLOCK
            pwm_src_clock = LEDC_USE_APB_CLK;
            #elif SOC_LEDC_SUPPORT_XTAL_CLOCK
            pwm_src_clock = LEDC_USE_XTAL_CLK;
            #else
            #error No supported PWM / LEDC clocks.
            #endif
        }
        #else
        #if SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
        pwm_src_clock = LEDC_USE_PLL_DIV_CLK;
        #elif SOC_LEDC_SUPPORT_APB_CLOCK
        pwm_src_clock = LEDC_USE_APB_CLK;
        #elif SOC_LEDC_SUPPORT_XTAL_CLOCK
        pwm_src_clock = LEDC_USE_XTAL_CLK;
        #else
        #error No supported PWM / LEDC clocks.
        #endif
        #endif

        #if SOC_LEDC_SUPPORT_REF_TICK
        if (freq < EMPIRIC_FREQ) {
            pwm_src_clock = LEDC_USE_REF_TICK;    // 1 MHz
        }
        #endif
    }

    // Check for clock source conflic in case of ESP32-S3/C3/C6
    #if !(PWM_SUPPORT_INDEP_CLOCK_SRC)

    ledc_clk_cfg_t pwm_clk = find_clock_in_use();
    if ((pwm_clk != LEDC_AUTO_CLK) && (pwm_clk != pwm_src_clock)) {
        mp_raise_ValueError(MP_ERROR_TEXT("one or more active timers use a different clock source, not supported by the current SoC."));
    }

    #endif

    // Note: High Speed Mode (available on ESP32 only, not on S2/S3), only supports REF_TICK(1MHz) and APB_CLK(80MHz)
    //       Low Speed Mode  (avail. on ESP32, S2, S3, C3, C6) supports [REF_TICK(1MHz)], RC_FAST_CLK(8Mhz) and APB_CLK(80MHz)

    int channel_idx = (self->lightsleepenabled) ? find_channel(self->pin, 0) : find_channel(self->pin, ANY_MODE);

    if (channel_idx == -1) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM channels:%d"), PWM_CHANNEL_MAX); // in all modes
    }

    int duty = args[ARG_duty].u_int;
    int duty_u16 = args[ARG_duty_u16].u_int;
    int duty_ns = args[ARG_duty_ns].u_int;
    if (((duty != -1) && (duty_u16 != -1)) || ((duty != -1) && (duty_ns != -1)) || ((duty_u16 != -1) && (duty_ns != -1))) {
        mp_raise_ValueError(MP_ERROR_TEXT("only one of parameters 'duty', 'duty_u16' or 'duty_ns' is allowed"));
    }

    // Check if freq wasn't passed as an argument
    if (freq == -1) {
        // Check if already set, otherwise use the default freq.
        // It is possible in case:
        // pwm = PWM(pin, freq=1000, duty=256)
        // pwm = PWM(pin, duty=128)
        if (chans[channel_idx].timer_idx != -1) {
            freq = timers[chans[channel_idx].timer_idx].freq_hz;
        }
        if (freq <= 0) {
            freq = PWM_FREQ;
        }
    }

    check_freq(self, freq);




    int timer_idx;
    int current_timer_idx = chans[channel_idx].timer_idx;
    bool current_in_use = is_timer_in_use(channel_idx, current_timer_idx);
    if (current_in_use) {
        timer_idx = find_timer(freq, SAME_FREQ_OR_FREE, CHANNEL_IDX_TO_MODE(channel_idx), pwm_src_clock);
    } else {
        timer_idx = chans[channel_idx].timer_idx;
    }

    if (timer_idx == -1) {
        if (self->lightsleepenabled) {
            timer_idx = find_timer(freq, SAME_FREQ_OR_FREE, 0, pwm_src_clock);
        } else {
            timer_idx = find_timer(freq, SAME_FREQ_OR_FREE, ANY_MODE, pwm_src_clock);
        }
    }
    if (timer_idx == -1) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), PWM_TIMER_MAX); // in all modes
    }

    #if !(PWM_SUPPORT_INDEP_CLOCK_SRC)
    // Check for the clock source consistency in case of ESP32-S3/C3 and C6
    if (is_timer_with_different_clock(timer_idx, pwm_src_clock)) {
        mp_raise_ValueError(MP_ERROR_TEXT("one or more active timers use a different clock source, which is not supported by the current SoC."));
    }
    #endif

    int mode = TIMER_IDX_TO_MODE(timer_idx);
    if (CHANNEL_IDX_TO_MODE(channel_idx) != mode) {
        // unregister old channel
        chans[channel_idx].pin = -1;
        chans[channel_idx].timer_idx = -1;
        chans[channel_idx].lightsleepenabled = false;
        // find new channel
        channel_idx = find_channel(self->pin, mode);
        if (CHANNEL_IDX_TO_MODE(channel_idx) != mode) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM channels:%d"), PWM_CHANNEL_MAX); // in current mode
        }
    }
    self->mode = mode;
    self->timer = TIMER_IDX_TO_TIMER(timer_idx);
    self->channel = CHANNEL_IDX_TO_CHANNEL(channel_idx);

    // New PWM assignment
    if ((chans[channel_idx].pin == -1) || (chans[channel_idx].timer_idx != timer_idx)) {
        configure_channel(self);
        chans[channel_idx].pin = self->pin;
    }
    chans[channel_idx].timer_idx = timer_idx;
    chans[channel_idx].lightsleepenabled = self->lightsleepenabled;
    self->active = true;

    // Set timer frequency
    set_freq(self, freq, &timers[timer_idx], pwm_src_clock);

    // Set duty cycle?
    if (duty_u16 != -1) {
        set_duty_u16(self, duty_u16);
    } else if (duty_ns != -1) {
        set_duty_ns(self, duty_ns);
    } else if (duty != -1) {
        set_duty_u10(self, duty);
    } else if (self->duty_x == 0) {
        set_duty_u10(self, (1 << PWM_RES_10_BIT) / 2); // 50%
    }
}

// This called from PWM() constructor
static mp_obj_t mp_machine_pwm_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, 4, true);
    gpio_num_t pin_id = machine_pin_get_id(args[0]);

    // create PWM object from the given pin
    machine_pwm_obj_t *self = mp_obj_malloc(machine_pwm_obj_t, &machine_pwm_type);
    self->pin = pin_id;
    self->active = false;
    self->lightsleepenabled = false;
    self->mode = -1;
    self->channel = -1;
    self->timer = -1;
    self->duty_x = 0;

    // start the PWM subsystem if it's not already running
    if (!pwm_inited) {
        pwm_init();
        pwm_inited = true;
    }

    // start the PWM running for this channel
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_pwm_init_helper(self, n_args - 1, args + 1, &kw_args);

